{
    "name": "Abuelita",
    "initial": [
        {
            "conditions": ["abuelita-introduced", "flaco-complete", "don-francisco-complete", "sofia-complete"],
            "path": "final-0"
        },
        {
            "conditions": ["abuelita-introduced"],
            "path": "idle-0"
        },
        {
            "conditions": [],
            "path": "beginning-0"
        }
    ],
    "entries": [
        {
            "key": "beginning-0",
            "value": {
                "sentences": [
                    "Mateo, mijito de mi vida, thank you for helping you poor abuelita with this community Altar for Dias de los Muerto. I’m so happy that you’re here.",
                    "We’re almost done with the decorations and festivities. Ohh I’m so excited.",
                    "Matteo, mijo, can you help your abuelita get the final pieces of the altar?"
                ],
                "select": {
                    "yes": "beginning-1",
                    "no": "beginning-2"
                }
            }
        },
        {
            "key": "beginning-1",
            "value": {
                "sentences": [
                    "Que? Como que no vas a ayudar! Matteo! Don’t make me get my chancal!"
                ],
                "next": "beginning-2"
            }
        },
        {
            "key": "beginning-2",
            "value": {
                "sentences": [
                    "Gracias mijito. Now I need you to go around town to get the last of the decorations",
                    "Ok, Don Fransisco has the last sugar skulls we need. Go to his store to see if he finally has them.  El Don said he’d help for the past 2 days but this man had done nothing but stare at that fountain all day!",
                    "Ohh, I saw El Flaco come to town over by the school. He always forgets his lunch so I made a little lunch for him. Make sure he eats all of it this time.",
                    "I almost forgot, Little Sofia made some little papel picado for the Altar too. I remember she would always help Oscar with painting the town so I’m sure she would love to help the altar.",
                    "Vangas patrace when you have everything mijo. You can keep playing with the ball Mateo, but don’t get too distracted jugando."
                ],
                "condition": "abuelita-introduced"
            }
        },
        {
            "key": "idle-0",
            "value": {
                "sentences": [
                    "Hola mijito, hope you’re having fun with the decorations. Did you get them all?"
                ],
                "select": {
                    "yes": "idle-1",
                    "no": "idle-2"
                }
            }
        },
        {
            "key": "idle-1",
            "value": {
                "sentences": [
                    "Oh that's great. Why don't you...",
                    "Mijo, it looks like you’re still missing a couple of decorations . Porque estas mentirando to your abuelita? Vas a ver Mateo!"
                ],
                "next": "idle-3"
            }
        },
        {
            "key": "idle-2",
            "value": {
                "sentences": [
                    "Estas bien mijo. Just don’t forget where you need to go for the decorations."
                ],
                "next": "idle-3"
            }
        },
        {
            "key": "idle-3",
            "value": {
                "sentences": [
                    "Go check the store to see if Don Fransisco has the rest of the sugar skulls for the Altar. I always see him looking at that fountain confused. Even now he doesn’t know how to fix it.",
                    "Mire el Flaco Felipe over by the school too. See if he has anything he can contribute to the altar. I know he’s doesn’t look too bright but he’s a good kid.",
                    "That hermosa Sofia also has some papel picado for the altar too. Look for her to go and pick it up.",
                    "Come back when you have everything Mijo. Gracias y mi amo!"
                ]
            }
        },
        {
            "key": "final-0",
            "value": {
                "sentences": [
                    "Hola mijito, did you get all the decorations?",
                    "Calavera? Perfeco. Papel picado? Perfecto! What’s this? One of your abuelito’s brushes? Dios mio Mateo this is wonderful! Thank you so much!",
                    "Aww I’m so happy Mateo. Soy muy muy muy feliz. Tu Abuelito would be so proud of you mijito. I can just imagine it now, his espiritue just smiling down on you.",
                    "Gracias Matteo. Now let’s get everyone to celebrate este Dia De Los Muetros!"
                ],
                "condition": "game-end"
            }
        }
    ]
}