{
    "name": "Don Francisco",
    "initial": [
        {
            "conditions": ["don-francisco-complete"],
            "path": "idle-final-0"
        },
        {
            "conditions": ["don-francisco-introduced", "well-puzzle-complete"],
            "path": "final-0"
        },
        {
            "conditions": ["don-francisco-introduced"],
            "path": "idle-0"
        },
        {
            "conditions": [],
            "path": "beginning-0"
        }
    ],
    "entries": [
        {
            "key": "beginning-0",
            "value": {
                "sentences": [
                    "Mateo! Como estas chico! Just in time too. We finally got those sugar skulls your abuelita has been asking for. Estas aqui to pick them up?",
                    "Ah I see. Well if you scratch my back then I'll scratch your hombre, eh?",
                    "You see the water from the fountain stopped running this morning... I’d fix it pero mi amor said I should stop doing so much physical labor. Could you help me?"
                ],
                "select": {
                    "yes": "beginning-1",
                    "no": "beginning-2"
                }
            }
        },
        {
            "key": "beginning-1",
            "value": {
                "sentences": [
                    "Perfecto! Nomas que I need your help with something."
                ],
                "next": "beginning-3"
            }
        },
        {
            "key": "beginning-2",
            "value": {
                "sentences": [
                    "No? Pues Perfecto! You can help me with something then."
                ],
                "next": "beginning-3"
            }
        },
        {
            "key": "beginning-3",
            "value": {
                "sentences": [
                    "The water from that fountain stopped running this morning.. I’d fix it pero mi amor said I should doing so many physical cosas. Could you help me?",
                    "Now it’s stuck on the roof of the store. Puedes ayudar getting the chancla off of the roof?"
                ],
                "select": {
                    "yes": "beginning-4",
                    "no": "beginning-5"
                }
            }
        },
        {
            "key": "beginning-4",
            "value": {
                "sentences": [
                    "Gracias Matteo. You’re a lifesaver. No sabes how much you’re helping Amelia. Those blisters on her feet are terrible.",
                    "I’m sure you can get it down somehow. A mejor you can kick it down with a ball or algo. Soy seguro you’ll figure it out."
                ],
                "condition": "don-francisco-introduced"
            }
        },
        {
            "key": "beginning-2",
            "value": {
                "sentences": [
                    "No preocupes then. Cuando tienes tiempo."
                ],
                "condition": "don-francisco-introduced"
            }
        },
        {
            "key": "idle-0",
            "value": {
                "sentences": [
                    "Como estas Mateo. How's the fountain problema going?",
                    "Si necesitas ayuda? Try hitting the fountain. I’m sure it’ll fall off si hagas."
                ]
            }
        },
        {
            "key": "final-0",
            "value": {
                "sentences": [
                    "Mateo, que magnifico! Gracias por todo. Se mira lindo!",
                    "Aqui son los sugar skulls. Make sure they find a good place with your abuela. What am I saying, I’m sure she will if it’s for her Oscar.",
                    "Ayyy Oscar.  Recuerdo los dias cuando we were just kids running around town for horas y horas. Ja we would go around kicking balones around seeing whatever we could break. You remind me a lot like him little Mateo.",
                    "Gracias Mijo. Get those calaveras to your sweet abuelita."
                ],
                "condition": "don-francisco-complete"
            }
        },
        {
            "key": "idle-final-0",
            "value": {
                "sentences": [
                    "Gracias Mateo... make sure your abuelita get her skulls."
                ]
            }
        }
    ]
}