{
    "name": "Sofia",
    "initial": [
        {
            "conditions": ["sofia-complete"],
            "path": "idle-final-0"
        },
        {
            "conditions": ["tree-puzzle-complete"],
            "path": "final-0"
        },
        {
            "conditions": ["sofia-introduced"],
            "path": "idle-0"
        },
        {
            "conditions": [],
            "path": "beginning-0"
        }
    ],
    "entries": [
        {
            "key": "beginning-0",
            "value": {
                "sentences": [
                    "Holla Matteeeeeeo, como esta-aaassss. Que estas haciendo aqui? Looking for some cool bottles to kick at?"
                ],
                "select": {
                    "yes": "beginning-1",
                    "no": "beginning-2"
                }
            }
        },
        {
            "key": "beginning-1",
            "value": {
                "sentences": [
                    "Ha, I knew it. Well no hay unos aqui. I’m keeping this school clean y lindo."
                ],
                "next": "beginning-3"
            }
        },
        {
            "key": "beginning-2",
            "value": {
                "sentences": [
                    "No? Pues Perfecto! You can help me with something then."
                ],
                "next": "beginning-3"
            }
        },
        {
            "key": "beginning-3",
            "value": {
                "sentences": [
                    "Oh, you're here for the papel picado! Sorry for thinking you’d just be here for trouble. I got all the papel right here. Nomas, there’s just one thing.",
                    "Mi gato, Mimi, is stuck on a tree. I keep on calling her but she doesn't get off. Es como she’s stuck up there. Pobrecita.",
                    "Mateo could you help me get her off the tree. What if she’s stuck there. I’m worried..."
                ],
                "select": {
                    "yes": "beginning-4",
                    "no": "beginning-5"
                }
            }
        },
        {
            "key": "beginning-4",
            "value": {
                "sentences": [
                    "Gracias Mateo. Maybe if you shake the tree you can get her off. Just don’t hit her. Mimi is a special kitty and I don’t want her to get hurt."
                ],
                "condition": "sofia-introduced"
            }
        },
        {
            "key": "beginning-5",
            "value": {
                "sentences": [
                    "Mateeooo, that’s not nice. She’s gonna be there forever!"
                ],
                "condition": "sofia-introduced"
            }
        },
        {
            "key": "idle-0",
            "value": {
                "sentences": [
                    "Matteo can you get Mimi off the tree? What if she never leaves it? What if she turns into a leaf!"
                ]
            }
        },
        {
            "key": "final-0",
            "value": {
                "sentences": [
                    "Mateo you got her! Gracias Matteo! If Mimi ever has babies I'll name one after you. Matteo for a boy... and... Margarita for a girl? You'll be eternalized como una princesa tambien!",
                    "Aqui es el papel picado. Thanks for letting me make your altar look pretty. Your abuelito would really like it. I remember one time he let me paint one of the walls with him. It was really cool! And your abuelita gave me cookies! Your abuelitos are really cool!",
                    "Your abuelito would really like it. I remember one time he let me paint one of the school cafeteria murals with him. It was really inspiring! Your abuelito painted the world in color and color en mi corazon."
                ],
                "condition": "sofia-complete"
            }
        },
        {
            "key": "final-1",
            "value": {
                "sentences": [
                    "Holla Matteeeeeeo, como esta-aaassss. Que estas haciendo aqui? Are you here for el papel picado?",
                    "I got all the papel right here. Nomas, there’s just one thing. Mi gato, Mimi, is stuck on a tree. I keep on calling her but she...",
                    "Oh there she is! Did you get her down from the tree for mi Mateo? Awwww gracias Mateo!",
                    "Aqui es el papel picado. Thanks for letting me make your altar look pretty and for helping me in the process. Your abuelito would really like it. I remember one time he let me paint one of the walls with him. It was really cool! And your abuelita gave me cookies! Your abuelitos are really cool!",
                    "Your abuelito would really like it. I remember one time he let me paint one of the school cafeteria murals with him. It was really inspiring! Your abuelito painted the world in color and color en mi corazon."
                ],
                "condition": "sofia-complete"
            }
        },
        {
            "key": "idle-final-0",
            "value": {
                "sentences": [
                    "Thanks for helping Mimi, Matteo. Nomas I have to just find him again, hopefully never in a tree."
                ]
            }
        }
    ]
}